/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*    bsp.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshimoma <yshimoma@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/17 00:12:09 by yshimoma          #+#    #+#             */
/*   Updated: 2024/06/17 00:12:55 by yshimoma         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Point.hpp"

/*
	a, b, c: 三角形の頂点
	point: 判定対象の点
	戻り値: 点が三角形の内部にある場合は True、そうでない場合は False を返します。
	つまり、点が頂点上または辺上にある場合は False を返します。
 */
bool bsp( Point const a, Point const b, Point const c, Point const point) {

}
